<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        PANDAS      
    </strong>
</p>

In [1]:
import pandas as pd

dados = [
    ["Anthony",2500.00, 29,"Sol Nascente"],
    ["Herbert",2008.00, 42,"Sol Nascente"],
    ["Cruz",1500.00, 18,"Morro Doce"],
    ["Souza",9000.00, 38,"Alphaville"]
]

colunas = ["Nome", "Salario", "Idade", "Bairro"]

df = pd.DataFrame(dados, columns=colunas)

df.head()   # 5 Primeiras e 5 últimas linhas
df.shape    # qtd linhas e colunas
df.info()   
df.describe()
df.dropna()
df['Nome']

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     4 non-null      object
 1   Salario  4 non-null      float64
 2   Idade    4 non-null      int64
 3   Bairro   4 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 260.0+ bytes

0    Anthony
1    Herbert
2       Cruz
3      Souza
Name: Nome, dtype: object

In [2]:
df.to_excel("Dados_pesoas.xlsx", index=False)

In [3]:
cod = 'Codigo-1505/12255'
p = cod.index('-')+1
cod[p:]

'1505/12255'

In [4]:
df['Salario'] > 2000

df[df['Salario']>2000]

      Nome  Salario  Idade        Bairro
0  Anthony   2500.0     29  Sol Nascente
1  Herbert   2008.0     42  Sol Nascente
3    Souza   9000.0     38    Alphaville

In [5]:
display(df.groupby('Bairro')['Salario'].mean())

Bairro
Alphaville      9000.0
Morro Doce      1500.0
Sol Nascente    2254.0
Name: Salario, dtype: float64

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 1 — Criando uma tabela de produtos   
    </strong>
</p>

In [ ]:
produtos = [
    ['Feijão', 4.99, 10, 'Sr Joao'],
    ['Arroz', 15.89, 15, 'Namorado'],
    ['Margarina', 6.99, 19, 'Qually'],
    ['Maionese', 8.89, 2, 'Helmans'],
    ['Maionese', 12.89, 23, 'Heinz'],
    ['Ketchup', 5.50, 25, 'Quero'],
    ['Mostarda', 4.89, 12, 'Quero']
]

Colunas_produtos = ['Produto','Preço', 'Estoque','Marca']

df_produtos = pd.DataFrame(produtos, columns=Colunas_produtos)

df_produtos

     Produto  Preço  Estoque     Marca
0     Feijão   4.99       10   Sr Joao
1      Arroz  15.89       15  Namorado
2  Margarina   6.99       19    Qually
3   Maionese   8.89        2   Helmans
4   Maionese  12.89       23     Heinz
5    Ketchup   5.50       25     Quero
6   Mostarda   4.89       12     Quero

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 2 — Visualizando as primeiras linhas
    </strong>
</p>

In [16]:
df_produtos.head()

     Produto  Preço  Estoque     Marca
0     Feijão   4.99       10   Sr Joao
1      Arroz  15.89       15  Namorado
2  Margarina   6.99       19    Qually
3   Maionese   8.89        2   Helmans
4   Maionese  12.89       23     Heinz

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 3 — Filtrando produtos caros
    </strong>
</p>

In [31]:
df_produtos[df_produtos['Preço']>10]

df_produtos.describe()

df_produtos['Preço'].max()

df_produtos.groupby('Produto')['Preço'].max()

df_produtos.groupby('Produto').agg(
    Maior_preço = ('Preço', 'max'),
    Maior_Estoque = ('Estoque', 'max'),
    total_preço = ('Preço', 'sum')
)

display(df_produtos)

     Produto  Preço  Estoque     Marca
0     Feijão   4.99       10   Sr Joao
1      Arroz  15.89       15  Namorado
2  Margarina   6.99       19    Qually
3   Maionese   8.89        2   Helmans
4   Maionese  12.89       23     Heinz
5    Ketchup   5.50       25     Quero
6   Mostarda   4.89       12     Quero

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 4 — Resumo por categoria
    </strong>
</p>

In [ ]:
display(df_produtos.groupby('Produto')['Preço'].mean().reset_index(name='Media'))

     Produto  Media
0      Arroz  15.89
1     Feijão   4.99
2    Ketchup   5.50
3   Maionese  10.89
4  Margarina   6.99
5   Mostarda   4.89